tap "ankitpokhrel/jira-cli"
tap "bufbuild/buf"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
tap "sambadevi/powerlevel9k"
tap "tilt-dev/tap"
tap "wix/brew"
brew "aws-iam-authenticator"
brew "node"
brew "bitwarden-cli"
brew "carthage"
brew "coreutils"
brew "ruby"
brew "fastlane"
brew "git"
brew "go"
brew "helm"
brew "jmeter"
brew "jq"
brew "kind"
brew "mas"
brew "minikube"
brew "protobuf"
brew "mosh"
brew "python@3.9"
brew "ruby@2.7"
brew "slides"
brew "watchman"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "bufbuild/buf/buf"
brew "hashicorp/tap/terraform"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tilt-dev/tap/tilt"
brew "wix/brew/applesimutils"
cask "font-hack-nerd-font"
cask "react-native-debugger"
cask "rectangle"

mas "Bitwarden", id: 1352778147
